my_app/lib/tasks/categories.rake

INSERT INTO "categories" ("category_name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["category_name", "Tables"], ["created_at", "2024-08-23 20:58:00.061326"], ["updated_at", "2024-08-23 20:58:00.061326"]]
---
task categories: :environment do
   Category.create([
                      {category_name: "Tables"},
                      {category_name: "Chairs"},
                      {category_name: "Beds"},
                      {category_name: "Desks"},
                      {category_name: "Dressers"},
                      {category_name: "Cupboards"}
                    ])