my_app/lib/tasks/products.rake

task products: :environment do
    require "nokogiri"
    require "open-uri"
    url = "https://www.enchantedlearning.com/wordlist/furniture.shtml#wls-id-a"
    html = OpenURI.open_uri(url)
    doc = Nokogiri::HTML(html)
    div_element = doc.css("div.wordlist-item")
    div_element.each do |item|
      prname = item.text.strip
      Product.create(
        category_id: Category.order("RANDOM()").first.id,
        product_name: prname,
        description: "Material: #{['Wood','Metal','Plastic'].sample}; Color: #{['Blue','Red','Green'].sample}",
        price: rand(500..10000),
        rating: rand(10..50)/10,
        quantity: rand(1..1000))
---
INSERT INTO "products" ("category_id", "product_name", "description", "price", "rating", "quantity", "image_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
SELECT "categories".* FROM "categories" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 1]]