my_app/app/views/profile/index.html.erb

SELECT "orders".* FROM "orders" WHERE (user_id = 5 AND order_status != 'Cart')
SELECT "order_products".* FROM "order_products" WHERE "order_products"."order_id" = ?  [["order_id", 3]]
SELECT SUM("order_products"."amount") FROM "order_products" WHERE "order_products"."order_id" = ?  [["order_id", 3]]
---
	          <td><%= order.id %></td>
	          <td><%= order.order_date %></td>
	          <td><%= order.order_status %></td>
	          <td><%= OrderProduct.where(order_id: order.id).sum(:amount) %></td>

SELECT "order_products".* FROM "order_products" WHERE "order_products"."order_id" = ?  [["order_id", 3]]
---
	          	<% sm = 0 %>
	          	<% OrderProduct.where(order_id: order.id).each {|ordpr| sm += Product.find_by(id: ordpr.product_id).price * ordpr.amount} %>