my_app/app/controllers/categories_controller.rb

  def show
    category = Category.find_by(id: params[:id])
    if category.present?
      @products_title = "Category #{category.category_name}"
      @products = Product.where(category_id: category.id)
    else
      @products_title = "All furniture"
      @products = Product.all
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."category_id" = ? ORDER BY rating desc  [["category_id", 1]]
SELECT "products".* FROM "products" ORDER BY rating desc