my_app/app/controllers/orders_controller.rb

SELECT "order_products".* FROM "order_products" WHERE "order_products"."order_id" = ? AND "order_products"."product_id" = ? LIMIT ?  [["order_id", 1], ["product_id", 3], ["LIMIT", 1]]
INSERT INTO "orders" ("user_id", "order_date", "order_status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 4], ["order_date", "2024-08-25"], ["order_status", "Not confirmed"], ["created_at", "2024-08-25 12:26:26.806954"], ["updated_at", "2024-08-25 12:26:26.806954"]]
INSERT INTO "order_products" ("order_id", "product_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["order_id", 1], ["product_id", 3], ["amount", 1], ["created_at", "2024-08-25 12:26:27.007238"], ["updated_at", "2024-08-25 12:26:27.007238"]]
---
  def add_to_cart
    order = current_order
    order_item = OrderProduct.find_by(order_id: order.id, product_id: params[:product_id])
    if order_item.present?
      redirect_to "/products/#{params[:product_id]}", alert: 'The item is already in the cart'
    else
      OrderProduct.create(order_id: order.id, product_id: params[:product_id], amount: 1)

SELECT "order_products".* FROM "order_products" WHERE "order_products"."order_id" = ?  [["order_id", 3]]
---
  def index
    @order = current_order
    @order_items = OrderProduct.where(order_id: @order.id)

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "order_products".* FROM "order_products" WHERE "order_products"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "order_products" WHERE "order_products"."id" = ?  [["id", 10]]
UPDATE "order_products" SET "amount" = ?, "updated_at" = ? WHERE "order_products"."id" = ?  [["amount", 2], ["updated_at", "2024-08-25 19:50:40.152373"], ["id", 10]]
---
  def update_quantity
    order_item = OrderProduct.find(params[:id])
    if params[:quantity].to_i <= 0
      order_item.destroy
    elsif params[:quantity].to_i <= order_item.product.quantity
      order_item.update(amount: params[:quantity])

SELECT COUNT(*) FROM "order_products" WHERE "order_products"."order_id" = ?  [["order_id", 6]]
UPDATE "orders" SET "order_status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["order_status", "New order"], ["updated_at", "2024-08-25 20:30:02.339477"], ["id", 6]]
---
  def checkout
    order = current_order
    if OrderProduct.where(order_id: order.id).count < 1
      redirect_to "/orders", alert: "The cart is empty"
    else
      order.update(order_status: 'New order', order_date: Time.now)

SELECT "orders".* FROM "orders" WHERE "orders"."order_status" = ? AND "orders"."user_id" = ? LIMIT ?  [["order_status", "Cart"], ["user_id", 5], ["LIMIT", 1]]
INSERT INTO "orders" ("user_id", "order_date", "order_status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 5], ["order_date", "2024-08-25"], ["order_status", "Cart"], ["created_at", "2024-08-25 20:30:02.790686"], ["updated_at", "2024-08-25 20:30:02.790686"]]
---
  def current_order
    order = Order.find_by(order_status: 'Cart', user_id: current_user.id)
    if not order.present?
      order = Order.create(user_id: current_user.id, order_status: 'Cart', order_date: Time.now)