my_app/app/controllers/profile_controller.rb

  def index
    @user = current_user
    @orders = Order.where("user_id = #{current_user.id} AND order_status != 'Cart'")
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ? LIMIT ?  [["user_id", 5], ["LIMIT", 1]]