my_app/app/views/orders/index.html.erb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
<% sm = 0 %>
<% @order_items.each {|order_item| sm += order_item.product.price * order_item.amount} %>